import { useNavigate } from 'react-router-dom';
import back_icon from '../../assets/button/back.svg';
import tripeer_icon from '../../assets//logo.webp';

export default function PrivacyPage() {
  const navigate = useNavigate();

  return (
    <div style={{ width: '100vw', height: '100vh', overflowY: 'scroll' }}>
      <header style={{ display: 'flex', gap: '20px' }}>
        <img
          src={back_icon}
          alt="back-icon"
          onClick={() => navigate(-1)}
          style={{ height: '50px', cursor: 'pointer' }}
        />
        <img
          src={tripeer_icon}
          alt="트리피어"
          style={{ height: '50px' }}
          onClick={() => navigate(-1)}
        />
      </header>
      <br />
      <br />
      <h1 style={{ fontSize: '2rem' }}>트리피어의 개인정보 보호 방침</h1>
      <br />
      <br />
      <section>
        <h3>트리피어(Tripeer) 개인정보 처리방침</h3>
        <p>
          여러분의 개인정보의 안전한 처리는 트리피어에게 있어 가장 중요한 일 중
          하나입니다. 여러분의 개인정보는 서비스의 원활한 제공을 위해서만
          수집됩니다. 법령에 의하거나 여러분이 별도로 동의하지 아니하는 한
          트리피어가 여러분의 개인정보를 제3자에게 제공하는 일은 절대 없으므로,
          안심하셔도 좋습니다. 개인정보 처리방침이 바뀐 때에는 여러분이 언제든지
          그 내용과 이유를 쉽게 알 수 있도록 트리피어의 공지사항을 통해
          전달하겠습니다.
        </p>
        <br />
        <p>
          여러분의 소중한 개인정보는 트리피어가 여러분에게 더 나은 서비스를
          제공하기 위해서만 활용됩니다.
        </p>
        <br />
        <h3>1. 개인정보의 처리 목적</h3>
        <p>
          트리피어는 서비스를 원활하게 제공하고 더욱 향상된 이용자 경험을 드리기
          위해 필요한 여러분의 개인정보를 수집합니다. 단지 여러분이
          어플리케이션을 설치 후 활용하려고 했던 서비스의 기본 기능, 여러 특화된
          기능을 제공하기 위해서 사용됩니다. 여행 스타일 등의 기능은 새로운
          서비스 개발 및 맞춤형 서비스 제공, 기능개 선, 법령 등에 규정된 의무의
          이행, 법령이나 이용약관에 반하여 여러분에게 피해를 줄 수 있는 잘못된
          이용행위의 방지를 위해서도 정보가 활용됩니다.
        </p>
        <h3>2. 처리하는 개인정보 항목</h3>
        <p>
          트리피어가 더 나은 서비스를 제공해 드리기 위해 수집하는 항목은 아래와
          같습니다. 트리피어는 여러분이 서비스에 처음 가입할 때 또는 서비스를
          이용하는 과정에서 홈페이지 또는 서비스 내 개별 어플리케이션이나
          프로그램 등을 통하여 여러분의 여행 스타일, 단말기 기타기기정보 (개별
          기기, 브라우저 또는 앱과 관련된 식별자입니다. IMEI 번호, MAC 주소),
          나이정보, 사진 등이 선택적으로 수집됩니다.
        </p>
        <br />
        <p>
          트리피어는 여러분의 별도 동의가 있는 경우나 법령에 규정된 경우를
          제외하고는 여러분의 개인정보 를 절대 제3자에게 제공하지 않습니다.
          개인정보는 부정한 이용으로 인한 분쟁을 방지하기 위한 내부방침에 따라
          보존한 다음 파기를 별도로 요청한 사용자에 한해서 파기됩니다.
        </p>
        <br />
        <h3>3. 개인정보 수집 방법</h3>
        <p>
          프로그램을 사용하기 위해 첫 어플리케이션 입장 후, 등록 페이지를 통해
          회원가입을 하는 사용자에 한해 해당 정보를 수집합니다.
        </p>
        <br />
        <h3>4. 자동수집 장치의 운용 및 거부</h3>
        <p>
          회사는 이용자 개개인에게 개인화되고 맞춤화된 서비스를 제공하기 위해
          이용자의 정보를 저장하고 수시로 불러오는 쿠키(cookie) 및
          로컬스토리지를 사용합니다. ① 쿠키 및 로컬스토리지의 사용 목적 회원과
          비회원의 접속 빈도나 방문 시간 등의 분석, 이용자의 취향과 관심분야의
          파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 정보 회수 파악
        </p>
        <br />
        <h3>5. 이용자 및 법정대리인의 권리와 그 행사방법</h3>
        <p>
          ① 정보주체는 자사에 대해 언제든지 다음 각 호의 개인정보 보호 관련
          권리를 행사할 수 있습니다. 1. 개인정보 열람 요구 2. 오류 등이 있을
          경우 정정 요구 3. 삭제 요구
        </p>
        <br />
        <h3>6. 개인정보의 처리 및 보유기간</h3>
        <p>
          ① 법령에 따른 개인정보 보유·이용기간 또는 이용자로 부터 개인정보를
          수집 시에 동의 받은 개인정보 보유·이용기간 내에서
          개인정보를처리·보유합니다. ② 각각의 개인정보 처리 및 보유 기간은
          다음과 같습니다.
        </p>
        <br />
        <p>
          1. 스마트폰 앱 회원 가입 및 관리 : 탈퇴 요청후 1년, 1년 이내 재가입시
          이는 무효화 됩니다. 가. 관계 법령 위반에 따른 수사․조사 등이 진행 중인
          경우에는 해당 수사․조사 종료 시 까지 나. 스마트폰 앱 이용에 따른
          채권․채무관계 잔존 시에는 해당 채권·채무관계 정산 시 까지 2. 재화 또는
          서비스 제공 : 재화·서비스 공급완료 및 요금결제․정산 완료시까지 다만,
          다음의 사유에 해당하는 경우에는 해당 기간 종료 시 까지 가.「전자상거래
          등에서의 소비자 보호에 관한 법률」에 따른 표시·광고, 계약내용 및 이행
          등 거래에 관한 기록 나.「통신비밀보호법」제41조에 따른 통신사실
          확인자료 보관
        </p>
        <br />
        <h3>7. 개인정보의 파기</h3>
        <p>
          ① 트리피어는 개인정보를 파기 요청시 일주일 이내 바로 파기합니다. ②
          이용자로부터 동의 받은 개인정보 보유기간이 경과하거나 처리목적이 달성
          되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는
          경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관
          장소를 달리하여 보존합니다. ③ 개인정보 파기의 절차 및 방법은 다음과
          같습니다. 1. 파기절차 회사는 파기 사유가 발생한 개인정보를 선정하고,
          회사 책임자의 승인을 받아 개인정보를 파기합니다. 2. 파기방법 회사는
          전자적 파일 형태로 기록 저장된 개인정보는 기록을 재생할 수 없도록
          파기합니다.
        </p>
        <br />
        <p>
          [책임자] 이름: 부수환 연락처:[010-5287-5716, rndjdieo119@naver.com]
        </p>
        <br />
        <p>
          트리피어는 법률이나 서비스의 변경사항을 반영하기 위한 목적 등으로
          개인정보 처리방침을 수정할 수 있습니다. 개인정보 처리방침이 변경되는
          경우 트리피어는 변경 사항을 게시하며, 변경된 개인정보 처리방침은
          게시한 날로부터 7일 후부터 효력이 발생합니다. 하지만, 피치 못하게
          여러분의 권리에 중요한 변경이 있을 경우 변경될 내용을 30일 전에
          공지하겠습니다.
        </p>
        <br />
        <br />
        <br />
      </section>
    </div>
  );
}
